import html
import random
import time
from FallenRobot import dispatcher
from FallenRobot.modules.disable import DisableAbleCommandHandler, DisableAbleMessageHandler
from telegram.error import BadRequest
from telegram.ext import CallbackContext ,Filters,CommandHandler, run_async

MLV_STRINGS = (
    "സ്നേഹം... അത് കൈകുമ്പിളിൽ കോരി എടുക്കാനോ തട്ടി എടുക്കാനോ കഴിയില്ല, അത് ഹൃദയത്തിൽ നിന്നും ഹൃദയത്തിലേക്കു പകർന്നു നൽകുവാനേ കഴിയു.❤️❤️😇.",
    "നിന്നെ പരിചയപെട്ടപ്പോഴോ.. നിന്നോട് സംസാരിച്ചു തുടങ്ങിയപ്പോഴോ ഞാൻ അറിഞ്ഞില്ല.. നീയെന്റെ ഹൃദയത്തിലോട്ട് ഒരു ടിക്കറ്റ് എടുക്കുമെന്ന് ഈ ടിക്കറ്റ് വച്ച് അടുത്ത സ്റ്റോപ്പിൽ ആണോ.. അതോ അവസാന സ്റ്റോപ്പിൽ ഇറങ്ങുക, അത് വ്യക്തമല്ല.. എന്നാലും ഞാൻ നിന്നെ ഒരുപാട് സ്നേഹിക്കുന്നു..😇💓💖 ",
    "നിന്റെ ഇഷ്ട്ടങ്ങൾ തേടി എന്റെ ഇഷ്ടങ്ങൾ എല്ലാം നീയായി.❤️❤️..",
    "എന്റെ ജീവിതം തുടങ്ങിയത് നിന്നോടൊപ്പം അല്ല പക്ഷെ എനിക്ക് ഉറപ്പുണ്ട് എന്റെ ജീവിതത്തിനു ഒരു അവസാനം ഉണ്ടെങ്കിൽ അത് നിന്നോട് ഒപ്പം ആയിരിക്കും, ആ അവസാന നിമിഷം വരെ ഞാൻ ഉണ്ടാവും നിന്റെ കൂടെ.💑💑..",
    "നിന്നിൽ ഞാൻ ഇനിയും പെയ്യും.. നിന്നെ നനച്ചു.. നിന്റെ ആത്മാവിനെ നെഞ്ചോടു ചേർക്കും.. ഒടുവിൽ ഞമ്മൾ ഒരു മഴയായി തീരും, ഒരുമിച്ച് പെയ്യും.❣️❣️💓💕",
    "ചിലർക്ക് ഞമ്മളാണ് ഏറ്റവും പ്രിയപ്പെട്ടത് എന്ന് കരുതുന്നുവെങ്കിലും...... അവർക്ക് പ്രിയം ഞമ്മളെ കാൾ മറ്റുള്ളവരോടാണ്, എന്നാ തിരിച്ചറിവ്.... വല്ലാത്ത നൊമ്പരം തന്നെയാണ്................ എന്നും.......... എപ്പോഴും 😊😊😭😭.......",
    "എന്റെ സ്വപ്നങ്ങളിൽ നിറയുന്നത് നിന്റെ മുഖം മാത്രം.. നീ എനിക്ക് എന്ത്ര പ്രിയ പെട്ടതാണെന്ന് പറയാൻ എനിക്ക് വാക്കുകൾ ഇല്ല.. എന്ത്ര കാലം വേണമെങ്കിലും കാത്തിരിക്കാം ഞാൻ.. നീ എന്റേത്‌ മാത്രമാവുന്ന നിമിഷത്തിനായി💘💘..",
    "ഓരോ യാത്രയിലും അറിയാതെ നിന്നെ തിരയുന്നു ഞാൻ.. കൈവിട്ടു പോയ നിന്റെ കൈകളെ.. നിന്റെ ഓർമകളെ.💔☹️☹️😢.",
    "ആകാശത്തിലെ നക്ഷത്രങ്ങളെയും, കടൽ തീരത്തെ മണൽ തരികളെയും എന്ന് ഞാൻ എണ്ണി തീർക്കുന്നോ അന്ന് ഞാൻ നിന്നെ മറക്കും.💘💘❤️❤️..",
    "കാണാൻ കൊതിക്കുന്ന മുഖവും.. കേൾക്കാൻ കൊതിക്കുന്ന ശബ്ദവും ഒരുപാട് അകലെ ആയിരിക്കുമ്പോൾ, സ്നേഹം ഒരു നൊമ്പരം മാത്രമാണ്.💔💔💔.",
    "മനസ് വിതുമ്പുന്ന സമയത്തും ചിരിക്കാൻ കഴിയുന്നത് ഭാഗ്യമാണ്, ഒരു വരദാനമാണ്.☺️☺️.. ഒന്നും ഇല്ലാത്തവർക്ക് ദൈവത്തിന്റെ സമ്മാനമാണ് അങ്ങനെ ചിരിക്കാൻ ഉള്ള കഴിവ്.☺️☺️😇.",
    "തിരക്ക് ഇല്ലങ്കിലും ചിലർ തിരക്കിൽ ആയിരിക്കും, എങ്ങനെ എങ്കിലും ഞമ്മുടെ മുന്നിൽ നിന്നും ഒഴിഞ്ഞു മാറി നിൽക്കാൻ.😣😣😣😖.",
    "കണ്ട് മുട്ടിയപ്പോൾമിണ്ടാൻഭയം..മിണ്ടിയപ്പോൾ ഇഷ്ട്പെടുമോ എന്നഭയം.ഇഷ്ട്പെട്ടപ്പോൾ പ്രണയിക്കുമോഎന്നഭയം.പ്രണയിച്ചപ്പോയോനഷ്ടപെടുമോഎന്നഭയവും",
    "നീ ഉറങ്ങാതെ സ്വപ്നo കണ്ടിട്ടുണ്ടോ.......ഞാൻ കണ്ടിട്ടുണ്ട് ..... നിന്നെ ജീവനായ് സ്നേഹിച്ചു തുടങ്ങിയ നാൾ മുതൽ....",
    "നിന്നെ ഇതിലേറെ സ്നേഹിക്കാൻ മറ്റാർക്കെങ്കിലും കഴിയുമായിരിക്കും പക്ഷെ.... ഇതിലേറെ മറ്റൊരാളെ സ്നേഹിക്കാൻ എനിക്കാവില്ല . ",
    "ദിനവും നിന്നെ ഓർത്താണ് ഉണരാറുള്ളതെന്നു കള്ളം പറയുന്നില്ല...പക്ഷേ ഉണർന്നാൽ ആദ്യം ഓർക്കുന്നത് നിന്നെ മാത്രമായിരിക്കും.."
  )

@run_async
DRK_STRINGS = (
    "പോടാ പട്ടി",
    "ഡാ പന്നി ",
    "പുന്നാര മോനെ",
    "പോടാ മാക്രി",
    "പോടാ നാറി",
    "വാടാ ... പട്ടീ",
    "പോയി ചാവടാ",
    "നീ പോടാ കാട്ടുകോഴി",
    "പോയി ചത്തൂടെ നിനക്ക്",
    "കോപ്പേ വല്യ ബഹളം വേണ്ട",
    "വല്യ മലരനാണല്ലോടാ നീ",
    "മണ്ണുണ്ണി",
    "ഡാ പന്നക്കിളവ",
    " നിന്റെ കുഞ്ഞമ്മേടെ നായർ",
    "നിന്റെ അപ്പൂപ്പനോട്‌ പോയി പറ",
    "പോ മലരേ"
  )

@run_async
def love(update, context):
    # reply to correct message
    reply_text = (
        update.effective_message.reply_to_message.reply_text
        if update.effective_message.reply_to_message
        else update.effective_message.reply_text
    )
    reply_text(random.choice(MLV_STRINGS))


def dark(update, context):
    # reply to correct message
    reply_text = (
        update.effective_message.reply_to_message.reply_text
        if update.effective_message.reply_to_message
        else update.effective_message.reply_text
    )
    reply_text(random.choice(DRK_STRINGS))



__mod_name__ = "love"

LOVE_HANDLER = DisableAbleCommandHandler("love", love)
DARK_HANDLER = DisableAbleCommandHandler("dark", dark)

dispatcher.add_handler(LOVE_HANDLER)
dispatcher.add_handler(DARK_HANDLER)
